use itech_library;

insert into books(title_ru,title_origin, description, book_cost, day_cost, edition_year, page_count, registration_date) values 
('Гарри Поттер и философский камень', 'Harry Potter and the Philosopher’s Stone', 'Первая книга из серии книг о Гарри Поттере', 40.25, 0.55, 2012, 550, '2022-01-22'),
('Гарри Поттер и тайная комната', 'Harry Potter and the Chamber of Secrets', 'Вторая книга из серии книг о Гарри Поттере', 45.55, 0.60, 2014, 450, '2022-01-22'),
('Гарри Поттер и узник Азкабана', 'Harry Potter and the Prisoner of Azkaban', 'Третья книга из серии книг о Гарри Поттере', 42.85, 0.58, 2014, 350, '2022-01-22'),
('Анна Каренина', '', 'Роман о трагической любви замужней дамы Анны Карениной и блестящего офицера Алексея Вронского', 30.50, 0.42, 2010, 350, '2022-01-22'),
('Война и мир', '', 'Роман-эпопея, описывающий русское общество в эпоху войн против Наполеона в 1805—1812 годах', 190.00, 1.20, 2017, 1500, '2022-01-22'),
('Маленький принц', 'Le Petit Prince', 'Аллегорическая повесть-сказка, рассказывающая о мальчике, который посещает различные планеты в космосе', 23.00, 0.20, 2015, 120, '2022-01-22'),
('Преступление и наказание', '', 'Cоциально-психологический и социально-философский роман', 40.00, 0.55, 2012, 350, '2022-01-22'),
('Благие знамения', 'Good Omens', 'Роман в жанре юмористического городского фэнтези', 48.00, 0.60, 2014, 320, '2022-01-22'),
('Гарри Поттер и Кубок огня', 'Harry Potter and the Goblet of Fire', 'Четвёртая книга из серии книг о Гарри Поттере', 48.00, 0.58, 2015, 450, '2022-01-22');

insert into authors(name, surname, photo_path) values
('Джоан', 'Роулинг', null),
('Лев', 'Толстой', null),
('Антуан де', 'Сент-Экзюпери', null),
('Фёдор', 'Достоевский', null),
('Терри', 'Пратчетт', null),
('Нил', 'Гейман', null);

insert into book_authors(book_id, author_id) values
(1, 1),
(2, 1),
(3, 1),
(4, 2),
(5, 2),
(6, 3),
(7, 4),
(8, 5),
(8, 6),
(9, 1);

/*
1 - классика,
2 - фантастика,
3 - научно-популярный,
4 - историко-документальный,
5 - детектив,
6 - приключения,
7 - роман,
8 - повесть,
9 - поэзия,
10 - профессиональная литература,
11 - религиозный,
12 - учебная литература,
13 - техника;
*/

insert into book_genres(book_id, genre_id) values
(1, 2),
(1, 6),
(1, 7),
(2, 2),
(2, 6),
(2, 7),
(3, 2),
(3, 6),
(3, 7),
(4, 1),
(4, 7),
(5, 1),
(5, 6),
(5, 7),
(6, 2),
(6, 8),
(7, 1),
(7, 7),
(8, 2),
(8, 7),
(9, 2),
(9, 6),
(9, 7);

insert into book_cover_photos(book_id, cover_photo_path) values
(1, 'Гарри_Поттер_и_философский_камень.jpg'),
(2, 'Гарри_Поттер_и_тайная_комната.jpg'),
(3, 'Гарри_Поттер_и_узник_Азкабана.jpg'),
(4, 'Анна_Каренина.jpg'),
(5, 'Война_и_мир.jpg'),
(5, 'Война_и_мир_2.jpg'),
(5, 'Война_и_мир_3.jpg'),
(6, 'Маленький_принц.jpg'),
(7, 'Преступление_и_наказание.jpg'),
(8, 'Благие_знамения.jpg');

insert into book_copies(book_id, copy_status, copy_state) values
(1, 'available', 'normal'),
(1, 'available', 'normal'),
(1, 'available', 'normal'),
(2, 'available', 'normal'),
(2, 'available', 'normal'),
(3, 'available', 'normal'),
(3, 'available', 'normal'),
(4, 'available', 'normal'),
(4, 'available', 'normal'),
(4, 'available', 'normal'),
(5, 'available', 'normal'),
(5, 'available', 'normal'),
(5, 'available', 'normal'),
(5, 'available', 'normal'),
(5, 'available', 'normal'),
(6, 'available', 'normal'),
(6, 'available', 'normal'),
(7, 'available', 'normal'),
(7, 'available', 'normal'),
(7, 'available', 'normal'),
(8, 'available', 'normal'),
(9, 'available', 'normal');







